{"_id":{"$oid":"640f1ce353ffdd1f54db45d8"},"title":"The Silence of the Lambs","description":"A young FBI cadet must receive the help of an incarcerated and manipulative cannibal killer to help catch another serial killer.","genre":{"genreName":"Thriller","description":"Thriller film, also known as suspense film or suspense thriller, is a broad film genre that involves excitement and suspense in the audience. Tension is created by delaying what the audience sees as inevitable, and is built through situations that are menacing or where escape seems impossible."},"director":{"directorName":"Jonathan Demme","bio":"Robert Jonathan Demme was an American director, producer, and screenwriter.","birthDate":{"$date":{"$numberLong":"-820540800000"}},"deathDate":{"$date":"2017-01-01T00:00:00Z"}},"imagePath":"silenceofthelambs.png","featured":true}
{"_id":{"$oid":"640f1eaf53ffdd1f54db45d9"},"title":"The Fifth Element","description":"In the colorful future, a cab driver unwittingly becomes the central figure in the search for a legendary cosmic weapon to keep Evil and Mr. Zorg at bay.","genre":{"genreName":"Sci-Fi","description":"Science fiction (sometimes shortened to sf or sci-fi) is a genre of speculative fiction, which typically deals with imaginative and futuristic concepts such as advanced science and technology, space exploration, time travel, parallel universes, and extraterrestrial life."},"director":{"directorName":"Luc Besson","bio":"Luc Paul Maurice Besson is a French film director, screenwriter and producer. He directed or produced the films Subway (1985), The Big Blue (1988), and La Femme Nikita (1990). Associated with the Cinéma du look film movement, he has been nominated for a César Award for Best Director and Best Picture for his films Léon: The Professional (1994) and the The Messenger: The Story of Joan of Arc (1999). He won Best Director and Best French Director for his sci-fi action film The Fifth Element (1997). He wrote and directed the 2014 sci-fi action film Lucy and the 2017 space opera film Valerian and the City of a Thousand Planets.","birthDate":{"$date":{"$numberLong":"-340588800000"}}},"imagePath":"thefifthelement.png","featured":true}
{"_id":{"$oid":"640f2e4353ffdd1f54db45da"},"title":"Terminator","description":"A human soldier is sent from 2029 to 1984 to stop an almost indestructible cyborg killing machine, sent from the same year, which has been programmed to execute a young woman whose unborn son is the key to humanity's future salvation.","genre":{"genreName":"Sci-Fi","description":"Science fiction (sometimes shortened to sf or sci-fi) is a genre of speculative fiction, which typically deals with imaginative and futuristic concepts such as advanced science and technology, space exploration, time travel, parallel universes, and extraterrestrial life."},"director":{"directorName":"James Cameron","bio":"James Francis Cameron is a Canadian filmmaker. A major figure in the post-New Hollywood era, he is considered one of the industry's most innovative filmmakers, regularly pushing the boundaries of cinematic capability with his use of novel technologies. He first gained recognition for writing and directing The Terminator (1984) and found further success with Aliens (1986), The Abyss (1989), Terminator 2: Judgment Day (1991), and the action comedy True Lies (1994). He wrote and directed Titanic (1997), Avatar (2009) and its sequels, with Titanic earning him Academy Awards for Best Picture, Best Director and Best Film Editing. A recipient of various other industry accolades, two of his films have been selected for preservation in the National Film Registry by the Library of Congress.","birthDate":{"$date":{"$numberLong":"-485308800000"}}},"imagePath":"terminator.png","featured":false}
{"_id":{"$oid":"640f2f8753ffdd1f54db45db"},"title":"Rear Window","description":"A wheelchair-bound photographer spies on his neighbors from his Greenwich Village courtyard apartment window, and becomes convinced one of them has committed murder, despite the skepticism of his fashion-model girlfriend.","genre":{"genreName":"Thriller","description":"Thriller film, also known as suspense film or suspense thriller, is a broad film genre that involves excitement and suspense in the audience. Tension is created by delaying what the audience sees as inevitable, and is built through situations that are menacing or where escape seems impossible."},"director":{"directorName":"Alfred Hitchcock","bio":"Sir Alfred Joseph Hitchcock was an English filmmaker. He is widely regarded as one of the most influential figures in the history of cinema. In a career spanning six decades, he directed over 50 feature films, many of which are still widely watched and studied today.","birthDate":{"$date":{"$numberLong":"-2221171200000"}},"deathDate":{"$date":"1980-04-29T00:00:00Z"}},"imagePath":"rearwindow.png","featured":false}
{"_id":{"$oid":"640f30db53ffdd1f54db45dc"},"title":"The Deer Hunter","description":"An in-depth examination of the ways in which the Vietnam War impacts and disrupts the lives of several friends in a small steel mill town in Pennsylvania.","genre":{"genreName":"War Drama","description":"War films typically tells the story of a small group of isolated individuals who – one by one – get killed (literally or metaphorically) by an outside force until there is a final fight to the death; the idea of the protagonists facing death is a central expectation in a war film. In a war film even though the enemy may out-number, or out-power, the hero, we assume that the enemy can be defeated if only the hero can figure out how."},"director":{"directorName":"Michael Cimino","bio":"Michael Antonio Cimino was an American filmmaker. One of the \"New Hollywood\" directors, Cimino achieved fame with The Deer Hunter (1978), which won five Academy Awards, including Best Picture and Best Director.","birthDate":{"$date":{"$numberLong":"-975456000000"}},"deathDate":{"$date":"2016-07-02T00:00:00Z"}},"imagePath":"thedeerhunter.png","featured":false}
{"_id":{"$oid":"640f31f253ffdd1f54db45dd"},"title":"Three Billboards Outside Ebbing, Missouri","description":"In the fictional town of Ebbing, Missouri, Mildred Hayes is grieving over the rape and murder of her teenage daughter, Angela, seven months earlier. Angry over the lack of progress in the investigation, she rents three disused billboards near her home and posts on them: \"Raped While Dying\", \"And Still No Arrests?\", \"How Come, Chief Willoughby?\".","genre":{"genreName":"Crime Drama","description":"Crime dramas explore themes of truth, justice, and freedom, and contain the fundamental dichotomy of \"criminal vs. lawman\". Crime films make the audience jump through a series of mental \"hoops\"; it is not uncommon for the crime drama to use verbal gymnastics to keep the audience and the protagonist on their toes."},"director":{"directorName":"Martin McDonagh","bio":"Martin Faranan McDonagh is a British-Irish playwright and filmmaker. He is known for his absurdist black humour which often challenges the modern theatre aesthetic. He has received numerous accolades including an Academy Award, six BAFTA Awards, four Golden Globe Awards, three Olivier Awards, and nominations for five Tony Awards.","birthDate":{"$date":"1970-03-26T00:00:00Z"}},"imagePath":"threebillboards.png","featured":true}
{"_id":{"$oid":"640f330b53ffdd1f54db45de"},"title":"Metropolis","description":"In a futuristic city sharply divided between the working class and the city planners, the son of the city's mastermind falls in love with a working-class prophet who predicts the coming of a savior to mediate their differences.","genre":{"genreName":"Sci-Fi","description":"Science fiction (sometimes shortened to sf or sci-fi) is a genre of speculative fiction, which typically deals with imaginative and futuristic concepts such as advanced science and technology, space exploration, time travel, parallel universes, and extraterrestrial life."},"director":{"directorName":"Fritz Lang","bio":"Friedrich Christian Anton Lang, known as Fritz Lang, was an Austrian film director, screenwriter, and producer who worked in Germany and later the United States. One of the best-known émigrés from Germany's school of Expressionism, he was dubbed the \"Master of Darkness\" by the British Film Institute. He has been cited as one of the most influential filmmakers of all time.","birthDate":{"$date":{"$numberLong":"-2495318400000"}},"deathDate":{"$date":"1976-08-02T00:00:00Z"}},"imagePath":"metropolis.png","featured":false}
{"_id":{"$oid":"640f34ad53ffdd1f54db45df"},"title":"Lawrence of Arabia","description":"The story of T.E. Lawrence, the English officer who successfully united and led the diverse, often warring, Arab tribes during World War I in order to fight the Turks.","genre":{"genreName":"Biography","description":"A biographical film or biopic is a film that dramatizes the life of a non-fictional or historically-based person or people. Such films show the life of a historical person and the central character's real name is used. They differ from docudrama films and historical drama films in that they attempt to comprehensively tell a single person's life story or at least the most historically important years of their lives."},"director":{"directorName":"David Lean","bio":"An important British filmmaker, David Lean was born in Croydon on March 25, 1908 and brought up in a strict Quaker family (ironically, as a child he wasn't allowed to go to the movies). During the 1920s, he briefly considered the possibility of becoming an accountant like his father before finding a job at Gaumont British Studios in 1927. He worked as tea boy, clapper boy, messenger, then cutting room assistant. By 1935, he had become chief editor of Gaumont British News until in 1939 when he began to edit feature films, notably for Anthony Asquith, Paul Czinner and Michael Powell. Amongst films he worked on were Der Roman eines Blumenmädchens (1938), Major Barbara (1941) and One of Our Aircraft Is Missing (1942). By the end of the 1930s, Lean's reputation as an editor was very well established.In 1942, Noël Coward gave Lean the chance to co- direct with him the war film In Which We Serve(1942).","birthDate":{"$date":{"$numberLong":"-1949356800000"}},"deathDate":{"$date":"1991-04-16T00:00:00Z"}},"imagePath":"lawrenceofarabia.png","featured":false}
{"_id":{"$oid":"640f359d53ffdd1f54db45e0"},"title":"Interstellar","description":"A team of explorers travel through a wormhole in space in an attempt to ensure humanity's survival.","genre":{"genreName":"Sci-Fi","description":"Science fiction (sometimes shortened to sf or sci-fi) is a genre of speculative fiction, which typically deals with imaginative and futuristic concepts such as advanced science and technology, space exploration, time travel, parallel universes, and extraterrestrial life."},"director":{"directorName":"Christopher Nolan","bio":"Christopher Edward Nolan is a British-American filmmaker. Known for his Hollywood blockbusters with complex storytelling, Nolan is considered a leading filmmaker of the 21st century. His films have grossed $5 billion worldwide. The recipient of many accolades, he has been nominated for five Academy Awards, five BAFTA Awards and six Golden Globe Awards. In 2015, he was listed as one of the 100 most influential people in the world by Time, and in 2019, he was appointed Commander of the Order of the British Empire for his contributions to film.","birthDate":{"$date":"1970-07-30T00:00:00Z"}},"imagePath":"interstellar.png","featured":true}
{"_id":{"$oid":"640f36c753ffdd1f54db45e1"},"title":"The Birds","description":"A wealthy San Francisco socialite pursues a potential boyfriend to a small Northern California town that slowly takes a turn for the bizarre when birds of all kinds suddenly begin to attack people.","genre":{"genreName":"Horror","description":"Horror is a film genre that seeks to elicit fear or disgust in its audience for entertainment purposes. Horror films often explore dark subject matter and may deal with transgressive topics or themes. Broad elements include monsters, apocalyptic events, and religious or folk beliefs. Cinematic techniques used in horror films have been shown to provoke psychological reactions in an audience."},"director":{"directorName":"Alfred Hitchcock","bio":"Sir Alfred Joseph Hitchcock was an English filmmaker. He is widely regarded as one of the most influential figures in the history of cinema. In a career spanning six decades, he directed over 50 feature films, many of which are still widely watched and studied today.","birthDate":{"$date":{"$numberLong":"-2221171200000"}},"deathDate":{"$date":"1980-04-29T00:00:00Z"}},"imagePath":"thebirds.png","featured":true}
{"_id":{"$oid":"640f387a53ffdd1f54db45e2"},"title":"Ghostbusters","description":"Three parapsychologists forced out of their university funding set up shop as a unique ghost removal service in New York City, attracting frightened yet skeptical customers.","genre":{"genreName":"Comedy","description":"A comedy film is a category of film which emphasizes humor. These films are designed to make the audience laugh through the amusement. Films in this style traditionally have a happy ending (black comedy being an exception). Comedy is one of the oldest genres in the film—and derived from the classical comedy in theatre."},"director":{"directorName":"Ivan Reitman","bio":"Ivan Reitman was a Czechoslovak-born Canadian filmmaker. He was best known for his comedy work, especially in the 1980s and 1990s. He was the owner of The Montecito Picture Company, founded in 1998.","birthDate":{"$date":{"$numberLong":"-731548800000"}},"deathDate":{"$date":"2022-02-12T00:00:00Z"}},"imagePath":"ghostbusters.png","featured":false}
